In [2]:
import numpy as np
import pandas as pd

In [19]:
df = pd.read_csv('../data/raw/raw.csv')

In [21]:
df.shape

(1044848, 8)

In [22]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,12/1/2009 7:45,6.95,13085.0,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,12/1/2009 7:45,6.75,13085.0,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,12/1/2009 7:45,2.10,13085.0,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,12/1/2009 7:45,1.25,13085.0,United Kingdom

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1044848 entries, 0 to 1044847
Data columns (total 8 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   Invoice      1044848 non-null  object
 1   StockCode    1044848 non-null  object
 2   Description  1040573 non-null  object
 3   Quantity     1044848 non-null  int64
 4   InvoiceDate  1044848 non-null  object
 5   Price        1044848 non-null  float64
 6   Customer ID  809561 non-null   float64
 7   Country      1044848 non-null  object
dtypes: float64(2), int64(1), object(5)
memory usage: 63.8+ MB

In [24]:
df['InvoiceDate'] = pd.to_datetime(df['InvoiceDate'])

In [25]:
df.isnull().sum()

Invoice             0
StockCode           0
Description      4275
Quantity            0
InvoiceDate         0
Price               0
Customer ID    235287
Country             0
dtype: int64

In [26]:
df[df['Description'].isnull() & df['Customer ID'].isnull()]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
470,489521,21646,NaN,-50,2009-12-01 11:44:00,0.0,NaN,United Kingdom
3114,489655,20683,NaN,-44,2009-12-01 17:26:00,0.0,NaN,United Kingdom
3161,489659,21350,NaN,230,2009-12-01 17:39:00,0.0,NaN,United Kingdom
3731,489781,84292,NaN,17,2009-12-02 11:45:00,0.0,NaN,United Kingdom
4296,489806,18010,NaN,-770,2009-12-02 12:42:00,0.0,NaN,United Kingdom
...,...,...,...,...,...,...,...,...
1038260,581199,84581,NaN,-2,2011-12-07 18:26:00,0.0,NaN,United Kingdom
1038264,581203,23406,NaN,15,2011-12-07 18:31:00,0.0,NaN,United Kingdom
1038270,581209,21620,NaN,6,2011-12-07 18:35:00,0.0,NaN,United Kingdom
1039919,581234,72817,NaN,27,2011-12-08 10:33:00,0.0,NaN,United Kingdom
1041492,581408,85175,NaN,20,2011-12-08 14:06:00,0.0,NaN,United Kingdom

In [27]:
#dropping rows with cancelled invoices
df = df[~df['Invoice'].str.contains('C', na=False)]
df.dropna(inplace=True)

In [30]:
df[df['Price']  == 0.0].sample(5)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
18739,490961,22142,CHRISTMAS CRAFT WHITE FAIRY,12,2009-12-08 15:25:00,0.0,14108.0,United Kingdom
589727,543599,84535B,FAIRY CAKES NOTEBOOK A6 SIZE,16,2011-02-10 13:08:00,0.0,17560.0,United Kingdom
550008,540372,22553,PLASTERS IN TIN SKULLS,24,2011-01-06 16:41:00,0.0,13081.0,United Kingdom
149201,503585,22459,CAST IRON HOOK GARDEN TROWEL,8,2010-04-01 17:13:00,0.0,13047.0,United Kingdom
471776,533822,22845,VINTAGE CREAM CAT FOOD CONTAINER,1,2010-11-19 09:40:00,0.0,12647.0,Germany

In [31]:
df[df['Price'] == 0.0]

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
4674,489825,22076,6 RIBBONS EMPIRE,12,2009-12-02 13:34:00,0.0,16126.0,United Kingdom
6781,489998,48185,DOOR MAT FAIRY CAKE,2,2009-12-03 11:19:00,0.0,15658.0,United Kingdom
16107,490727,M,Manual,1,2009-12-07 16:38:00,0.0,17231.0,United Kingdom
18738,490961,22065,CHRISTMAS PUDDING TRINKET POT,1,2009-12-08 15:25:00,0.0,14108.0,United Kingdom
18739,490961,22142,CHRISTMAS CRAFT WHITE FAIRY,12,2009-12-08 15:25:00,0.0,14108.0,United Kingdom
...,...,...,...,...,...,...,...,...
982017,577129,22464,HANGING METAL HEART LANTERN,4,2011-11-17 19:52:00,0.0,15602.0,United Kingdom
982491,577168,M,Manual,1,2011-11-18 10:42:00,0.0,12603.0,Germany
983587,577314,23407,SET OF 2 TRAYS HOME SWEET HOME,2,2011-11-18 13:23:00,0.0,12444.0,Norway
988923,577696,M,Manual,1,2011-11-21 11:57:00,0.0,16406.0,United Kingdom
1005060,578841,84826,ASSTD DESIGN 3D PAPER STICKERS,12540,2011-11-25 15:57:00,0.0,13256.0,United Kingdom

In [32]:
df.drop_duplicates(inplace=True)

In [33]:
df.isnull().sum()

Invoice        0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
Price          0
Customer ID    0
Country        0
dtype: int64

In [15]:
df.sample(10)

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
191326,507464,21875,KINGS CHOICE MUG,396,2010-05-10 11:00:00,0.85,18102.0,United Kingdom
493543,535531,22356,CHARLOTTE BAG PINK POLKADOT,10,2010-11-26 15:16:00,0.85,17841.0,United Kingdom
300548,518663,21732,RED HANGING METAL STAR TLIGHT HLDR,2,2010-08-10 14:27:00,3.75,14044.0,United Kingdom
1023645,580296,23546,WRAP PAISLEY PARK,25,2011-12-02 13:49:00,0.42,13780.0,United Kingdom
496657,535832,22176,BLUE OWL SOFT TOY,6,2010-11-29 09:41:00,2.95,17547.0,United Kingdom
743465,558105,84692,BOX OF 24 COCKTAIL PARASOLS,1,2011-06-26 14:54:00,0.42,15644.0,United Kingdom
972243,576592,23301,GARDENERS KNEELING PAD KEEP CALM,2,2011-11-15 14:47:00,1.65,13614.0,United Kingdom
174938,505976,22610,PENS ASSORTED FUNNY FACE,36,2010-04-27 08:58:00,0.85,14625.0,United Kingdom
400348,527732,22111,SCOTTIE DOG HOT WATER BOTTLE,6,2010-10-18 15:45:00,4.95,15777.0,United Kingdom
246480,513259,22315,200 RED + WHITE BENDY STRAWS,12,2010-06-23 10:53:00,1.25,15785.0,United Kingdom

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 779425 entries, 0 to 1044847
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   Invoice      779425 non-null  object
 1   StockCode    779425 non-null  object
 2   Description  779425 non-null  object
 3   Quantity     779425 non-null  int64
 4   InvoiceDate  779425 non-null  datetime64[ns]
 5   Price        779425 non-null  float64
 6   Customer ID  779425 non-null  float64
 7   Country      779425 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 53.5+ MB

In [17]:
df.to_csv('../data/processed/cleaned.csv', index=False)